app/Http/Controllers/AppController.php

    public function home()
    {
        $featured = Feature::where('bucket_key' , 'home_primary_featured')->get()->map(function($feature) {
            return $feature->featured;
        });
        $slides = Slide::all();
        $families = Family::all();
---
select * from `slides` where `slides`.`deleted_at` is null
select * from `families` where `families`.`deleted_at` is null