app/Http/Controllers/AppController.php

select * from `features` where `bucket_key` = 'home_primary_featured'
select * from `slides` where `published` = 1 and `slides`.`deleted_at` is null
select * from `families` where `published` = 1 and `families`.`deleted_at` is null
---
    public function home()
    {
        $featured = Feature::where('bucket_key' , 'home_primary_featured')->get()->map(function($feature) {
            return $feature->featured;
        });
        $slides = Slide::where('published', 1)->get();
        $families = Family::where('published', 1)->get();