app/Http/Controllers/BikeController.php

    public function show($slug)
    {
        $bike = Bike::forSlug($slug)->first();
        $bike = app(BikeRepository::class)->forSlug($slug);
        $family_id = $bike->families()->first()->id;
        $family = Family::find($family_id);
        $related_bikes = $family->bikes()->get();
---
select * from `bike_slugs` where `bike_slugs`.`bike_id` in (2) and `bike_slugs`.`deleted_at` is null
select `families`.*, `bike_family`.`bike_id` as `pivot_bike_id`, `bike_family`.`family_id` as `pivot_family_id` from `families` inner join `bike_family` on `families`.`id` = `bike_family`.`family_id` where `bike_family`.`bike_id` = 18 and `families`.`deleted_at` is null limit 1
select `families`.*, `bike_family`.`bike_id` as `pivot_bike_id`, `bike_family`.`family_id` as `pivot_family_id` from `families` inner join `bike_family` on `families`.`id` = `bike_family`.`family_id` where `bike_family`.`bike_id` = 2 and `families`.`deleted_at` is null limit 1
select `bikes`.*, `bike_family`.`family_id` as `pivot_family_id`, `bike_family`.`bike_id` as `pivot_bike_id` from `bikes` inner join `bike_family` on `bikes`.`id` = `bike_family`.`bike_id` where `bike_family`.`family_id` = 4 and `bikes`.`deleted_at` is null