app/Http/Controllers/ContactController.php

select * from `countries` where `countries`.`deleted_at` is null
---
    public function index()
    {
        $countries = Country::all();