app/Http/Controllers/PageController.php

select * from `page_slugs` where `page_slugs`.`page_id` in (4) and `page_slugs`.`deleted_at` is null
---
    public function show($page)
    {
        $page = Page::forSlug($page)->first();