app/Http/Controllers/SearchController.php

select `families`.*, `bike_family`.`bike_id` as `pivot_bike_id`, `bike_family`.`family_id` as `pivot_family_id` from `families` inner join `bike_family` on `families`.`id` = `bike_family`.`family_id` where `bike_family`.`bike_id` = 2 and `families`.`deleted_at` is null limit 1
---
    public function jsearch($searchterm)
    {
        // $search_results = (new Search())
        //                 ->registerModel(\App\Models\Translations\BikeTranslation::class, 'title')
        //                 ->search($searchterm);
        // return response()->json($search_results);
        $slugs_array = [];
        $i = 0;

        $bikes = BikeTranslation::search($searchterm)->where('locale', app()->getLocale())->get();
        foreach($bikes as $bike) {
            $bike_id = $bike->bike_id;
            $bike_slug = Bike::find($bike_id)->slug;
            $bike_family = Bike::find($bike_id)->first()->families()->first()->translate(app()->getLocale())->title;
            $family_slug = Bike::find($bike_id)->first()->families()->first()->slug;
            $bikes[$i]["url"] = route('site.bikes.show', ["locale" => app()->getLocale(), "slug" => $bike_slug]);
            $bikes[$i]["locale"] = app()->getLocale();
            $bikes[$i]["family_name"] = $bike_family;
            $bikes[$i]["family_slug"] = Bike::find($bike_id)->first()->families()->first()->slug;