app/Http/Controllers/SearchController.php

select * from `bike_translations` where `title` LIKE '%kobal%' and `locale` = 'fr' and `bike_translations`.`deleted_at` is null
---
    public function jsearch($searchterm)
    {
        // $search_results = (new Search())
        //                 ->registerModel(\App\Models\Translations\BikeTranslation::class, 'title')
        //                 ->search($searchterm);
        // return response()->json($search_results);
        $slugs_array = [];
        $bikes = BikeTranslation::where('title', 'LIKE', '%'.$searchterm.'%')
            ->where('locale', app()->getLocale())->get();