app/Http/Controllers/StoreController.php

    public function getStoresForDepartment($department)
    {
        $dep = intval($department);
        $department = Department::where('number', $dep)->first();
---
select * from `departments` where `number` = 10 limit 1