app/Http/Controllers/StoreController.php

    public function index()
    {
        $departments = Department:: all();
        $stores = Store::all();
---
select * from `stores` where `stores`.`deleted_at` is null

    public function getStoresForDepartment($department)
    {
        $dep = intval($department);
        $stores = Store::with(['countries' => function($q) {
            $q->where('alpha2', 'fr');
        }])->where('dep', $dep)->get();
---
select * from `countries` where `alpha2` = 'fr' and `countries`.`deleted_at` is null
select * from `stores` where `dep` = 49 and `stores`.`deleted_at` is null

    public function getEuropeanStores()
    {
        $eu = ['at', 'be', 'bg', 'cy', 'cz', 'de', 'dk', 'ee', 'es', 'fi', 'gb', 'gr', 'hr', 'hu', 'ie', 'it', 'lt', 'lu', 'lv', 'mt', 'nl', 'po', 'pt', 'ro', 'se', 'si', 'sk'];
        $neu = ['al', 'ad', 'am', 'ba', 'by', 'ch', 'fo', 'ge', 'gi', 'is', 'mc', 'mk', 'no', 'ru', 'sm', 'tr', 'ua', 'va'];
        $a = ['de'];
        $s = Store::whereHas('countries', function ($q) use ($eu, $neu) {
            $q->whereIn('alpha2', $eu)
                ->orwhereIn('alpha2', $neu)
                ->orderBy('alpha2', 'asc');
        })->orderBy('title', 'ASC')->get();
---
select * from `stores` where exists (select * from `countries` inner join `country_store` on `countries`.`id` = `country_store`.`country_id` where `stores`.`id` = `country_store`.`store_id` and (`alpha2` in ('at', 'be', 'bg', 'cy', 'cz', 'de', 'dk', 'ee', 'es', 'fi', 'gb', 'gr', 'hr', 'hu', 'ie', 'it', 'lt', 'lu', 'lv', 'mt', 'nl', 'po', 'pt', 'ro', 'se', 'si', 'sk') or `alpha2` in ('al', 'ad', 'am', 'ba', 'by', 'ch', 'fo', 'ge', 'gi', 'is', 'mc', 'mk', 'no', 'ru', 'sm', 'tr', 'ua', 'va')) and `countries`.`deleted_at` is null order by `alpha2` asc) and `stores`.`deleted_at` is null order by `title` asc